CSI API ETABS v1
cSapModel.GetModelFilepath Method
 Returns the filepath of the current model
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
string GetModelFilepath()
Function GetModelFilepath As String
Dim instance As cSapModel
Dim returnValue As String
returnValue = instance.GetModelFilepath()
String^ GetModelFilepath()
abstract GetModelFilepath : unit -> string
Return Value
Type: String
 Returns a string that represents the filepath of the current model
Remarks
See Also
Reference
cSapModel Interface
ETABSv1 Namespace